app/Controllers/Book.php

SELECT *
FROM `book_category`
---
        public function create(){
            session();
            $data = [
                'title'=>'Tambah Buku',
                'category'=> $this->catModel->findAll(),