app/Controllers/Distributor.php

    public function index()
    {
        $datasDistributor = $this->distributorModel->findAll();
---
SELECT *
FROM `distributor`