app/Controllers/Supplier.php

SELECT *
FROM `supplier`
---
    public function index()
    {
        $datasSupplier = $this->supplierModel->findAll();