app/Models/BookModel.php

SELECT *
FROM `book`
JOIN `book_category` USING (`book_category_id`)
WHERE `deleted_at` is null
---
    public function getBook($slug = false)
{
    /*$this->table('book')
    ->join('book_category','book.book_category_id = book_category.book_category_id');
    return $this->get()->getResultArray();*/
    $query = $this->table('book')
    ->join('book_category','book_category_id')
    ->where('deleted_at is null');
    if($slug == false)
    return $query->get()->getResultArray();