app/Models/MajalahModel.php

SELECT *
FROM `majalah`
JOIN `majalah_category` USING (`majalah_category_id`)
WHERE `deleted_at` is null
---
    public function getMajalah($slug = false)
{
    /*$this->table('majalah')
    ->join('majalah_category','majalah.majalah_category_id = majalah_category.majalah_category_id');
    return $this->get()->getResultArray();*/
    $query = $this->table('majalah')
    ->join('majalah_category','majalah_category_id')
    ->where('deleted_at is null');
    if($slug == false)
    return $query->get()->getResultArray();